{
  "title": "justtolisten_Stroke-Sexy-TeaseJOIEdge-joip",
  "thumbnail": "https://cdn.imgchest.com/files/l7lxcpv58p7.jpg",
  "narration": "https://media.soundgasm.net/sounds/5a9e009b5e1d465ed406ef44a6964766aca674d9.m4a",
  "items": [
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/l7lxcpv58p7.jpg",
      "caption": "Hey there honey... I know why you're here... \nYou've got something.. very special.. in those pants for me don't you?\nSomething you want to touch... to feel... to stroke...\nWell don't be shy, take it out.. let me see."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/84jdcvae5k4.jpg",
      "caption": "Oh my gosh.. it's beautiful...\nThe length, the size, the color..\nThe look of it is so perfect, I just want to.. \n...well I'll let you find out later. \nThere's just one problem though.. and it's a big problem too."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/pyq9c3jl9z4.jpg",
      "caption": "You're.. cock... is not.. NEARLY.. as hard as it should be..\nA cock of that nature should be bulging... it should be pulsating..\nYour cock should be hard as my pussy is soft.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/myd5cewa634.jpg",
      "caption": "But we can fix that.. can't we?\nWe can get that thing of yours solid as a rock. I'm going to get you so damn stiff that the ONLY way you'll be able to get rid of it is to.. stroke... sexy... mmm.\nI want you to get completely naked and spread your legs.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/3yrgcnqj2k4.jpg",
      "caption": ".. we're going to focus ALL of our attention on that half-hearted hard on you've got down there..\nNow I want you to think about my long... soft.. and warm legs. \nThink about how nice it would feel to rub that stiff dick of yours from the top of my high socks to the very bottom of my ass...\nThink about how wonderful it would feel to go back and forth and back and forth until you couldn't take the tease anymore..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/j7mmc9b6pq7.jpg",
      "caption": "Now take both of your hands and grip your WHOLE dick for me... \noh yea..\nBase to tip..\nthat's it... \ngrip it nice and tight..\nfeel the blood build up all the way to that pretty little dick head of yours.. feel your veins begin to throb... feel the... anticipation growing along with the size of that huge member of yours...\nThink about how good it would feel if I just took my tongue and licked the tip of that glowing tip of yours.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/k739cxqjvo7.jpg",
      "caption": "Alright... start stroking... softly...\nmmmmm...\nYou know.. the more you stroke... the more... I'm going stroke myself too... I mean... what's the point in stroking sexy if you can't enjoy it with someone else? Hehe.\nHmm.. I still feel like you're holding back...\n... you need more motivation don't you?"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/w7w6c2k3dpy.jpg",
      "caption": "Well why don't you take a little look at what I'll be stroking..\nThere we go... now that's how you should be..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/wye3c2eqma4.jpg",
      "caption": "Come on.. let's get that pre-cum out already... I want you to rub it all of the tip of that cock of yours. \nDon't be afraid to stroke a little faster and harder now...\nYou're a big boy... you can handle it right?"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/g4z9cvgz5r7.jpg",
      "caption": "Yea... you're a Reallly big boy... \nGo ahead and use two hands now.. \nMassage the tip while you stroke your base...\nOh yea... \nFeels good doesn't it?"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/e4gdcxgjqr4.jpg",
      "caption": "Now let go!\nJust listen to my voice for a second while we let your buddy cool off for a second..\nThe key to stroking sexy is to hold out from releasing too quickly... \nYou see... the longer we delay your gratification... the greater your satisfaction will be...\nOh.. you're wondering why I'm still stroking? Well I'm special ;-) hehe."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/my8xcnz5op4.jpg",
      "caption": "Alright, now grab that cock of yours again and get to stroking...\nFocus on my beautiful and soft breasts...\nMy tight and pleasing pussy...\nAnd most of all..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/345xcvb2x97.jpg",
      "caption": "Think about how downright pleasant it would feel to have cute, fuckable face inches away from that stone solid cock of yours...\nI want you to edge...\nI want you to stroke yourself to the point where the cum is about to enter into your shaft...\nYea...\nOh...\nThat's it..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/84apc5rpav4.jpg",
      "caption": "Now let it in flow into the shaft but hold it in! Don't let that cum out yet!\nKeep stroking while you hold that cum inside of you... \nFeel every pleasure filled tug while your cock is on the brink of release..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/k46acqrpx37.jpg",
      "caption": "Stroke sexy... yea... that's it.\nKeep going...\nStroke...\nKeep going...\nStroke sexy...\nKeeep going..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/pyvdcw3kmky.jpg",
      "caption": "Now release."
    }
  ]
}