{
  "title": "Justtolisten_F4M-Drain-JOIP-stroke-with-the-pics",
  "thumbnail": "https://cdn.imgchest.com/files/j7mmc9b6vp7.jpg",
  "narration": "https://media.soundgasm.net/sounds/9eff23e36752cc846f13dd23e5f5a4f46e9932d5.m4a",
  "items": [
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/j7mmc9b6vp7.jpg",
      "caption": "Hey there... why don't you drop those pants for me.. but make sure to keep your shorts or underwear on though.. don't worry, they won't be on for long. ^_^"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/k739cxqj9l7.jpg",
      "caption": "Now let's get comfortable.. I want you to rub yourself though your shorts.. lets wake that little guy up.. lol. \nTake a good look at that cute face... and her lovely hips... \nOh! What's that? I think we can see her breast through that shirt a little bit. Well isn't that.. just... nice."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/w7w6c2k3lwy.jpg",
      "caption": "Oh my! Well look at that! Well if she's going all out I guess you should too. \nNow take off those shorts and just admire her body.. that means no stroking yet.. in fact.. no touching either..\nI want you sitting there with your cock out staring at those lovely breasts of hers... and that cute little tight pussy...\nBut after that, you should really take some time to admire those lips..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/wye3c2eqa54.jpg",
      "caption": "Now take your four fingers and slowly and SOFTLY rub them up and down your shaft 10 times while you think about how soft those things look. \nhow gentile.. \nhow kissable...\nYou know, they'd definitely feel good on the lips... but I think I know a place where they would even feel better.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/g4z9cvgzrq7.jpg",
      "caption": "Lick your off hand and rub the top half of your cock 10 times.\nThat looks sooo good doesn't it. I bet it feels good too.. \nhaving a nice wet tongue massage the tip of your dick so slowly and gracefully\nI hope your as hard as that guys is.. if not.. don't worry. lol. I'll get you there.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/e4gdcxgjex4.jpg",
      "caption": "Now spit in your dominant hand and just rub all of that saliva on... get it nice and wet. \nMake sure to cover the whole thing.. \nYou see... I'm preparing you for something..\nWhat am I preparing you for you ask?"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/my8xcnz5me4.jpg",
      "caption": "Rub the base of your cock 7 times.\nWell you see... I'm going to drain the CUM out of you.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/345xcvb23z7.jpg",
      "caption": "Now Stroke!\n25 nice and full strokes...\nI want you to feel each and every one of those wonderful jerks..\nImagine that you were looking deep into her eyes while that cock slides in and out of her..\nHer pussy is tight but it's surprisingly deep too.. the deeper you go.. the better it feels!\nCome on... deep strokes.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/84apc5rpxl4.jpg",
      "caption": "30 faster and harder strokes... and I want you to close your eyes while you enjoy it..\nYeaa... that's it..\nKeep those eyes closed and listen to my voice..\nIt feels good to stroke your cock doesn't it? \nYou've been waiting alll day to finally sit down and have some time to yourself. \nNow's the time baby... no holding back... make EACH and EVERY stroke feel as though it is better than the last... \nCan you do that for me?\nOk, open your eyes!"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/k46acqrpwa7.jpg",
      "caption": "Now's the time to do something special baby...\nYou're going to use both hands. Grab your cock. And stroke it slowly 10 times...\nNice..\nSensual...\nStrokes...\nFeels good doesn't it?\nI bet you wanna cum..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/pyvdcw3kpzy.jpg",
      "caption": "Oh? You're not ready to cum yet?\nWell we'll have to change that huh?"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/6yxkczewam7.jpg",
      "caption": "25 normal and regular strokes..\nWe're going to build you up really nicely..."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/b49zc2j3x6y.jpg",
      "caption": "Now grab those cum filled balls of yours and massage them while you stroke yourself 25 times faster.\nNot too fast though! \nThis is a slow build up.."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/l4nec89qak4.jpg",
      "caption": "Keep massaging!\nDo 25 more and stop being such a puss, stroke harder!"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/p7bwckmpww7.jpg",
      "caption": "Now grip the base of your cock as HARD as you can and hold it until I tell you to let go....\n...\n...\n...\nAlright.. let go."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/w7pjcql2ro7.jpg",
      "caption": "Are you ready yet?\n30 fast and tight strokes.\nI hope you're ready... \nYou know why?\nBecause I'm going to DRAIN the cum out of you baby...\nEvery last drip will be mine..\nEvery last fucking drip is mine."
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/d7ogcb26dvy.jpg",
      "caption": "Now 35 FAST and FURIOUS strokes!\nCome on baby! \nStroke that fucking cock!\n...\nNow stroke yourself to the EDGE!"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/j7kzca6k2b7.jpg",
      "caption": "CUM!\nLet it ALL out!\nI want EVERY LAST drip in your HAND.\nCum in that hand and leave it there for me. \nI have a little surprise last instruction for you. :)"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/my2pckmel57.jpg",
      "caption": "Take the cum that's in your hand right now and rub it ALL over that cock.\nYea you heard me right..\nRub that empty cock of yours with your own cum.. \nYou can thank me in the comments. ;)"
    },
    {
      "type": "image",
      "src": "https://cdn.imgchest.com/files/l7lxcpv5lr7.jpg",
      "caption": "Well thanks for following my instructions.. and please... cum again."
    }
  ]
}